var a = `仅仅创建一年，就获得了过亿美元的估值，拉勾网究竟凭什么能够取得如此傲人的成绩？下面，我们带大家一起来探索拉勾网的秘密。 互联网 垂直招聘网站拉勾网今天正式宣布B轮融资，本次融资由启明创投领投、贝塔斯曼亚洲投资基金跟投共计2500万美金。从去年7月上线，截止今年7月，已有超过20000多家互联网公司入驻拉勾网，既包括了 BAT 等大牌公司，也有锤子科技、小米、美团等高速成长的黑马公司，覆盖包括移动互联网、电商、游戏、 O2O 等多个互联网细分领域。毫无疑问，拉勾网已经成为互联网公司招聘人才的必争之地。而从项目立项时估值不足千万，到现在整体估值8亿人民币左右，拉勾网一年时间，已经在互联网行业人尽皆知，背后有哪些创业细节可值分享？ 找对合伙人：有底线的“分歧”是创业团队的灵魂 拉勾管理团队是典型的铁三角：许单单、马德龙、鲍艾乐（Ella），许单单是董事长，把握大局；马德龙担任CEO，负责产品和团队管理；Ella作为联合创始人，负责市场和一些运营工作。他们之前都在腾讯工作过，后来由于筹办3W咖啡聚在一起。3W咖啡成立后，由一个14人的执委会团队来打理，但慢慢的其他人来的越来越少，最后只剩下了他们3个人。马德龙说这是“剩者为王”。他们3人开始也是兼职，后来大家觉得这件事值得放手一搏，陆续开始全职投入。 团队老大许单单是偏冷静的人，对于人际关系有着自己深刻的认识，但很多时候是根据自己喜好来打交道，不喜欢的时候更多是一个人默默的坐在一边。在这期间，许单单因为工作需要去了美国，只剩下马德龙和Ella来打理咖啡馆。马德龙属于乐天派，开放乐观，人很灵活，“只要确定了目标，我就会通过各种方式都可以完成。”而Ella属于典型的完美主义者，从小就是那种“考了第三要求自己下次必须考第一”的人，她形容自己“先天就有一种危机感和焦虑感”，这种感觉一直促使着自己不安于现状，一直朝着前方拼命奔跑。她习惯事情按照计划一步步实现，擅长和各种人打交道，但是喜欢“以自己的方式来达到目标”。马德龙形容她“一旦决定，很难拧过来”，但最后大家往往都能达成一致。 在Ella看来，三个人搭档的团队是最稳定的， 如果是两个人合伙，意见不一时，可能就掰了，但是三个人就极大的规避了这个问题。当其中两个人意见不和时，起码另外一个人可以调和。 同时三个人有不同的擅长领域：许单单善于整合资源、马德龙擅长产品和设计、Ella精于市场和运营。三个模块有机的组合在一起，形成了一个高效的团队。 某种意义上，“分歧”是这个创业团队的灵魂所在，正体现了三个人强势互补的地方。 但是，这不代表彼此之间没有分歧甚至争吵。在开咖啡馆的时候，因为不同的见解，马德龙和Ella吵架后，分开坐两张桌子，背对背谁都不理谁。曾经有一次，许单单和Ella因为对于公司发展不能达成一致时，吵得特别厉害，以至于Ella说自己“情绪几乎失控，觉得这简直不是人能干出来的事情”，但是最后，在乐观的马德龙的调停下，他们还是达成了一致。 在拉勾创业过程中，不管有多么大的分歧，即使在公司现金流最紧张的时候，团队默认的底线从没有被打破过：“不管怎么争吵，也不会提出要离开，大家一定要把这件事做下去；即使意见再不一致，也不会有人按照自己的想法擅自行动；最后实在不能达成一致，就让老大拍板。”马德龙说，“合伙这事就像婚姻一样，不过怎么样，日子一定要过下去，决不能一赌气提离婚。” 在马德龙看来，之前发生在创业圈里的“泡面吧事件”，开了一个相当恶劣的先例。（注：泡面吧两个合伙人之间为了争夺股权和老大位子，不惜删除代码，搅黄了A轮融资，最终散伙的事件）。为了自己的一己私利，不惜牺牲整个团队、牺牲用户、牺牲投资者等所有人的利益。“这绝对是不能容忍的！” 向企业收钱，给用户做产品 从拉勾网建立的第一天开始，马德龙要求所有产品的设计和服务都是围绕着求职者来展开的，这彻底的颠覆了传统招聘的游戏规则。 网络招聘在人们的印象中，一直是件冷冰冰的事情，但是拉勾网通过擅长的媒体运作赋予了它温度和情感。 今年上半年，腾讯正式宣布撤销电商控股公司，调整和裁撤了部门和员工，拉勾第一个打出广告，联合包括阿里、唯品会和1号店等电商巨头，帮助离开的人选择更合适的去向。今年下半年，微软裁撤中国区诺基亚数千名员工，拉勾发起了“每个人青春中都有一部诺基亚，请为诺基亚点赞”的活动，迅速帮助离职的人入职到小米、锤子科技等公司。整个活动获得了巨大成功，光是微信转发量就达到了近10万人。 拉勾目前主要的商业模式是企业用户付费，按企业招聘不同岗位、不同月薪进行收费。 目前使用拉勾的企业达数万家，拉勾为其中一部分提供收费服务，其中包括360等知名公司。但拉勾和其它传统招聘网站最大的不同是：向企业收钱，但是给用户做产品。马德龙觉得这是一件很酷的事，“除了360，没有别的商业模式是这样子。他们都是给谁做产品，就向谁收钱。” 在拉勾上，为了保护求职者的利益，岗位薪水是必须要标注的，但 京东 在招聘时，包括前台、开发工程师等十几个职业，刚开始薪水全都是1k，拉勾联系了京东，要求对方进行处理。但拉勾的工作人员很快发现，京东把所有人的薪水都改成了10-15K。对于这种无视规则的行为，拉勾直接将京东的职位下架了，以至于后来京东的高管找马德龙交涉，但直到对方按照规则完善后，职位才重新上架。 同时，拉勾网为了保护求职者的信息安全和隐私，硬性规定只有求职者自己才能给企业发简历。 在拉勾上，是求职者和企业方一对一直接联系。这就有效的杜绝了第三方获取求职者个人信息的风险。但是，对于企业，拉勾却要求信息尽可能详细的披露，接近透明化。 比如说，拉勾网上的很多企业，外界知道的名字和工商注册的名字不是一样的，比如360几乎人人皆知，但是很少有人知道北京奇虎科技有限公司，传统网站用的都是企业工商注册的名字，这就导致求职者看到的信息是不对称的，会极大影响求职和招聘的效率。拉勾会强制性要求招聘公司使用外界皆知的名字。 除此之外，招聘公司的主页、产品、发展阶段等资料会被列出来，比如 360 的公司资料里就显示其美国上市公司，CEO是周鸿祎，他的个人资料、工作经历，求职者还可以一键查看他的微博，同时还有关于360的相关报道“360大萌妹子首度集体告白”。帮助求职者更好更全面的了解招聘公司，求职者面对的不再是一个冷冰冰的网页，而是带着丰富元素和色彩的立体信息，同时也是对招聘公司一次很生动的宣传。 腾讯系的产品经：极致体验是留住用户的唯一方法 在拉勾网，马德龙是最大的产品经理，整个产品团队由他直接带领。这个上升星座是处女座的CEO对于产品的挑剔到了苛刻的程度。在这一点上，他和他崇拜的偶像、锤子科技的创始人 罗永浩 有惊人的一致性。罗永浩经常念叨“这还不够”，在锤子手机上会因为一个小的动画效果修改上百次。马德龙会因为推敲一两句寥寥数语的简单的提示而修改几十遍。 马德龙说自己做产品的体会就是：“看似无比性感的功能，做出来后反应却一般。看似不起眼的一些功能，投入使用后却无比性感”。2013年年底，拉勾网联合百度、腾讯等10家公司举行了一个急速入职活动，招聘公司必须在当天给求职者答复。活动持续了一周，带来了拉勾的第一个增长的引爆点，整体数据增长了数倍。这件事给了拉勾团队极大的启发：必须加快企业HR的反应速度，尽可能缩短求职者的跳槽窗口期，降低求职者等待的焦虑感，这可以极大改善用户的体验。 在电商行业，曾经有一个不太起眼的功能，但是带用户带来了质变的极佳体验：用户购物后，可以在网站或者手机上可以看到物流的整个过程，让用户全程掌握。拉勾网把这种全程透明的概念引入到了原本封闭暗箱的招聘流程中：用户的简历有没有被HR收到，有没有被HR看过，HR现在是什么样的状态，要不要约求职者面试，什么时间面试等等。用户可以快速、全程收到拉勾微信信息提示。 类似的功能和细节在拉勾产品上还有很多，但是马德龙觉得，产品的体验是没有尽头的，只有不断的优化，给用户带去极致的体验才是留住用户的唯一方法。 所以拉勾网能做出这样的成绩，不仅仅是一个好点子的问题，更多的是抓住了很多的细节获得的成功。 【 本文由IT思维网采编发布，所有转载请注明文章作者和来源 】`

var le = a.length
var byte = Buffer.byteLength(a);
console.log(le)
console.log(byte)

const test = (text) => {
    console.log(`text.length:${text.length}-------------byte length:${Buffer.byteLength(text
        , 'utf8')}`)
    var splitArr = text.split(/(\.|\?|!|。|？|！)/g)
    var textArr = []
    var subText = ""
    splitArr.forEach(function (substr) {
        if ((subText + substr).length > 1000 && subText.length != 0) {
            textArr.push(subText)
            subText = substr
        } else if ((subText + substr).length > 1000 && subText.length == 0) {
            subText += substr
            textArr.push(subText)
            subText = ""
        } else {
            subText += substr
        }
    }, this);
    textArr.push(encodeURI(subText))

}

test(a)